In [2]:
import numpy as np
import pandas as pd

In [10]:
df = pd.DataFrame([
    {'nama': 'Andi', 'fisika': 90, 'biologi': 78},
    {'nama': 'Budi', 'fisika': 95, 'biologi': 80},
    {'nama': 'Caca', 'fisika': 92, 'biologi': 82}
])

df2 = pd.DataFrame([
    {'nama': 'Andi', 'math': 90, 'chemistry': 95},
    {'nama': 'Budi', 'math': 80, 'chemistry': 98},
    {'nama': 'Caca', 'math': 88, 'chemistry': 98}
])

dfGroup = df.groupby('nama')
dfGroup.groups.keys()

dict_keys(['Andi', 'Budi', 'Caca'])

In [11]:
dfGroup.mean()

      fisika  biologi
nama
Andi      90       78
Budi      95       80
Caca      92       82

In [12]:
dfGroup.get_group('Andi').max()['fisika']

90

In [13]:
df[df['nama'] == 'Andi']['fisika'].max()

90

In [18]:
dfX = pd.concat([df, df2], axis=1, join='inner',ignore_index=True, sort=False)
dfX

      0   1   2     3   4   5
0  Andi  90  78  Andi  90  95
1  Budi  95  80  Budi  80  98
2  Caca  92  82  Caca  88  98

In [21]:
df7 = pd.DataFrame([
    {'nama': 'Andi', 'fisika': 90, 'biologi': 78},
    {'nama': 'Budi', 'fisika': 95, 'biologi': 80},
    {'nama': 'Caca', 'fisika': 92, 'biologi': 82}
])

df8 = pd.DataFrame([
    {'nama': 'Andi', 'math': 90, 'chemistry': 95},
    {'nama': 'Budi', 'math': 80, 'chemistry': 98},
    {'nama': 'Caca', 'math': 88, 'chemistry': 98},
    {'nama': 'Deni', 'math': 88, 'chemistry': 90}
])

In [25]:
dfY = pd.merge(df7,df8) #Menggabungkan 2 DataFrame
dfY

   nama  fisika  biologi  math  chemistry
0  Andi      90       78    90         95
1  Budi      95       80    80         98
2  Caca      92       82    88         98

In [24]:
dfZ = pd.merge(df7,df8, how = 'outer') #Menggabungkan 2 DataFrame dengan metode outer join
dfZ

   nama  fisika  biologi  math  chemistry
0  Andi    90.0     78.0    90         95
1  Budi    95.0     80.0    80         98
2  Caca    92.0     82.0    88         98
3  Deni     NaN      NaN    88         90

In [33]:
df9 = pd.DataFrame([
    {'test': 1, 'nama': 'Andi', 'fisika': 90, 'biologi': 78},
    {'test': 2, 'nama': 'Andi', 'fisika': 95, 'biologi': 80},
    {'test': 3, 'nama': 'Andi', 'fisika': 92, 'biologi': 82},
    {'test': 1, 'nama': 'Budi', 'fisika': 90, 'biologi': 78},
    {'test': 2, 'nama': 'Budi', 'fisika': 95, 'biologi': 80},
    {'test': 3, 'nama': 'Budi', 'fisika': 92, 'biologi': 82}
])
df9

   test  nama  fisika  biologi
0     1  Andi      90       78
1     2  Andi      95       80
2     3  Andi      92       82
3     1  Budi      90       78
4     2  Budi      95       80
5     3  Budi      92       82

In [35]:
df9 = df9.pivot(index = 'test', columns = 'nama')
df9.columns

MultiIndex([( 'fisika', 'Andi'),
            ( 'fisika', 'Budi'),
            ('biologi', 'Andi'),
            ('biologi', 'Budi')],
           names=[None, 'nama'])

In [36]:
df9['fisika']

nama  Andi  Budi
test
1       90    90
2       95    95
3       92    92

In [62]:
df10 = pd.DataFrame({
    'mapel': ['biologi', 'biologi', 'biologi', 'fisika', 'fisika', 'fisika'],
    'test':[1, 2, 3, 1, 2, 3],
    'Andi': [78, 80, 82, 90, 95, 92],
    'Budi': [88, 89, 72, 80, 85, 72]
})
df10 = df10.set_index(['mapel', 'test'])
df10

              Andi  Budi
mapel   test
biologi 1       78    88
        2       80    89
        3       82    72
fisika  1       90    80
        2       95    85
        3       92    72

In [61]:
df11 = df10.unstack().swaplevel(0, 1, 1).sort_index(1)
df11

mapel biologi      fisika
         Andi Budi   Andi Budi
test
1          78   88     90   80
2          80   89     95   85
3          82   72     92   72

In [3]:
df12 = pd.DataFrame([
    {'test': 1, 'nama': 'Andi', 'fisika': 90, 'biologi': 78},
    {'test': 2, 'nama': 'Andi', 'fisika': 95, 'biologi': 80},
    {'test': 3, 'nama': 'Andi', 'fisika': 92, 'biologi': 82},
    
])

df13 = pd.DataFrame([
    {'test': 1, 'nama': 'Budi', 'fisika': 90, 'biologi': 78},
    {'test': 2, 'nama': 'Budi', 'fisika': 95, 'biologi': 80},
    {'test': 3, 'nama': 'Budi', 'fisika': 92, 'biologi': 82}
])

In [4]:
1. BPS => multi index
2. pd.melt
3. pd.crosstab
4. pd.read_sql #Baca Query
5. pd.read_sql_table

SyntaxError: invalid syntax (<ipython-input-4-44745f3e57fa>, line 1)